"""Файл для хранения констант."""

LENGTH_FOR_FIELD_USERS = 150
"""Длина поля для модели пользователя."""

LENGTH_FOR_FIELD_EMAIL = 254
"""Длина поля email для модели."""

LENGTH_FOR_FIELD_RECIPES = 200
"""Длина поля для модели рецепта."""

LIST_PER_PAGE = 6
"""Ограничение на количество отображаемых объектов."""

SLICE = 20
"""Ограничение количества отображаемых символов в текстовом поле."""

MIN_VALUE = 1
"""Минимальное значение для валидатора."""

MAX_VALUE = 32766
"""Максимальное значение для валидатора."""
